Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute.GetCorrectDialogAttributeType Method
 Initializes a new StructuresDialogAttribute instance.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Type GetCorrectDialogAttributeType(
	string attributeType
)
Public Shared Function GetCorrectDialogAttributeType (
	attributeType As String
) As Type
Parameters
attributeType
Type: System.String
The attribute type of the property, default is String.
Return Value
Type: Type
[Missing <returns> documentation for "M:Tekla.Structures.Dialog.StructuresDialogAttribute.GetCorrectDialogAttributeType(System.String)"]
See Also
Reference
StructuresDialogAttribute Class
Tekla.Structures.Dialog Namespace